DataProcessors/ПечатьМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьМНО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог530Формы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПечатьМНО/Forms/ФормаПечатьУведомленияОНамерении/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Объект.КаталогСохранения = ПолучитьКаталогСохранения(Параметры.МассивДокументов[0].СчетДоверительногоУправления, Объект.КаталогСохранения);
	
	Если Параметры.Свойство("ПорученияНаПереводСоСчетовБрокера") Тогда
	
		ЭтаФорма.ВидПечати = 1; // 1 - поручение на перевод со счетов брокера	
		Объект.КаталогСохранения = ?(СтрНайти(Объект.КаталогСохранения, "МНО") > 0, СтрЗаменить(Объект.КаталогСохранения, "МНО", "Перевод с брокера"), Объект.КаталогСохранения);	
		
	КонецЕсли;	
		
	НомерВерсииФормы = ПолучитьНомерВерсииФормы(ЭтаФорма.ВидПечати);
	
	ИмяМакета = "";
		
	Если НомерВерсииФормы = 1 Тогда
		ИмяМакета = "УведомлениеОНамерении";
	ИначеЕсли НомерВерсииФормы = 2 Тогда
		ИмяМакета = "УведомлениеОНамерении2025";
	ИначеЕсли НомерВерсииФормы = 3 Тогда
		ИмяМакета = "УведомлениеОНамерении2025_2";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить макет для печати уведомлений.");
		Возврат;
	КонецЕсли;
		 
	ШаблонПодтверждения = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	
	Если Параметры.Свойство("МассивДокументов") Тогда
		СписокДокументов.ЗагрузитьЗначения(Параметры.МассивДокументов);
		Элементы.Подписант.СписокВыбора.ЗагрузитьЗначения(ОбработкаОбъект.ПолучитьПодписантов(Параметры.МассивДокументов));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СохранитьПечатнуюФорму Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КаталогСохранения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан каталог сохранения уведомлений!",,"КаталогСохранения",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНомерВерсииФормы(ВидПечати)
	
	НомерВерсии = 0;
	
	Если ВидПечати = 1 Тогда
		
		НомерВерсии = 3;
		
	Иначе
	
		ТекДата = ТекущаяДата(); 
		
		Если ТекДата < '20250528' Тогда
			НомерВерсии = 1;
		ИначеЕсли ТекДата > '20251116' Тогда
			НомерВерсии = 3;
		Иначе
			НомерВерсии = 2;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НомерВерсии;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКаталогСохранения(СчетДоверительногоУправления, ТекущийКаталог)
	
	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("КаталогУведомлениеОНамерении", СчетДоверительногоУправления, ТекущаяДата(), ТекущийКаталог);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивУведомлений(МассивДокументов, Подписант, НомерВерсииФормы, ВидПечати)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Обработки.ПечатьМНО.СформироватьМенеджерВременныхТаблицСДанными(МассивДокументов);
	
#Область Текст_Запроса	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДокументов.Дата КАК Период,
		|	&Подписант КАК ФизЛицо,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА _ДанныеДокументов.Дата >= РеквизитыСотрудников.Период
		|				ТОГДА ПОДСТРОКА(РеквизитыСотрудников.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыСотрудников.Отчество, 1, 1) + "". "" + РеквизитыСотрудников.Фамилия
		|		КОНЕЦ, ЕСТЬNULL(ВЫБОР
		|				КОГДА _ДанныеДокументов.Дата >= РеквизитыАнкетные.Период
		|					ТОГДА ПОДСТРОКА(РеквизитыАнкетные.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыАнкетные.Отчество, 1, 1) + "". "" + РеквизитыАнкетные.Фамилия
		|			КОНЕЦ, &Подписант)) КАК Подпись
		|ПОМЕСТИТЬ _ПолнаяТаблицаРеквизитовФизЛиц
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних КАК РеквизитыСотрудников
		|		ПО (РеквизитыСотрудников.ЮрФизЛицо = &Подписант)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних КАК РеквизитыАнкетные
		|		ПО (РеквизитыАнкетные.ЮрФизЛицо = &Подписант)
		|ГДЕ
		|	&Подписант ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|	_ПолнаяТаблицаРеквизитовФизЛиц.Подпись КАК Подпись
		|ПОМЕСТИТЬ _РеквизитыФизЛиц
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаРеквизитовФизЛиц.ФизЛицо КАК ФизЛицо,
		|		МАКСИМУМ(_ПолнаяТаблицаРеквизитовФизЛиц.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаРеквизитовФизЛиц КАК _ПолнаяТаблицаРеквизитовФизЛиц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаРеквизитовФизЛиц.ФизЛицо) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаРеквизитовФизЛиц КАК _ПолнаяТаблицаРеквизитовФизЛиц
		|		ПО ВложенныйЗапрос.ФизЛицо = _ПолнаяТаблицаРеквизитовФизЛиц.ФизЛицо
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаРеквизитовФизЛиц.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыУБрокеров.Период КАК Период,
		|	КодыУБрокеров.Брокер КАК Брокер,
		|	КодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыУБрокеров.ДоговорБрокерскогоОбслуживания КАК Договор,
		|	КодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _ПолнаяТаблицаКодовУБрокера
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК КодыУБрокеров
		|		ПО _ДанныеДокументов.Организация = КодыУБрокеров.Организация
		|			И _ДанныеДокументов.СчетДоверительногоУправления = КодыУБрокеров.СчетДоверительногоУправления
		|			И _ДанныеДокументов.Брокер = КодыУБрокеров.Брокер
		|			И _ДанныеДокументов.Дата >= КодыУБрокеров.Период
		|			И (&ВидПечати = 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПолнаяТаблицаКодовУБрокера.Брокер КАК Брокер,
		|	_ПолнаяТаблицаКодовУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПолнаяТаблицаКодовУБрокера.Договор КАК Договор,
		|	_ПолнаяТаблицаКодовУБрокера.Код КАК Код
		|ПОМЕСТИТЬ _КодыУБрокера
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаКодовУБрокера.Брокер КАК Брокер,
		|		_ПолнаяТаблицаКодовУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ПолнаяТаблицаКодовУБрокера.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаКодовУБрокера КАК _ПолнаяТаблицаКодовУБрокера
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаКодовУБрокера.Брокер,
		|		_ПолнаяТаблицаКодовУБрокера.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаКодовУБрокера КАК _ПолнаяТаблицаКодовУБрокера
		|		ПО ВложенныйЗапрос.Брокер = _ПолнаяТаблицаКодовУБрокера.Брокер
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ПолнаяТаблицаКодовУБрокера.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаКодовУБрокера.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
		|	РеквизитыКлиентаАнкетные.ЭтоПиф КАК ЭтоПиф,
		|	ВЫБОР
		|		КОГДА РеквизитыКлиентаАнкетные.ЭтоПиф
		|			ТОГДА ВЫБОР
		|					КОГДА &НомерВерсииФормы = 1
		|						ТОГДА ""фонда ""
		|					ИНАЧЕ """"
		|				КОНЕЦ + ВЫРАЗИТЬ(РеквизитыКлиентаАнкетные.ЮрФизЛицо КАК Справочник.ПаевыеИнвестиционныеФонды).Наименование
		|		ИНАЧЕ РеквизитыКлиентаАнкетные.Наименование
		|	КОНЕЦ КАК НаименованиеКлиента,
		|	ВЫБОР
		|		КОГДА РеквизитыКлиентаАнкетные.ЮрФизЛицо ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
		|			ТОГДА ВЫРАЗИТЬ(РеквизитыКлиентаАнкетные.ЮрФизЛицо КАК Справочник.ПаевыеИнвестиционныеФонды).НомерПравил
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерПравил,
		|	РеквизитыБанка.ПолноеНаименованиеПоУставу КАК НаименованиеБанка,
		|	РеквизитыБанка.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеБанка,
		|	РеквизитыБанка.ИНН КАК ИННБанка,
		|	РеквизитыБрокера.ПолноеНаименованиеПоУставу КАК НаименованиеБрокера,
		|	РеквизитыБрокера.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеБрокера,
		|	РеквизитыБрокера.ИНН КАК ИНН_Брокера,
		|	РеквизитыБрокера.ОГРН КАК ОГРН_Брокера,
		|	_КодыУБрокера.Код КАК КодУБрокера,
		|	_КодыУБрокера.Договор.НомерДоговора КАК ДоговорСБрокером,
		|	_КодыУБрокера.Договор.ДатаЗаключения КАК ДатаДоговораСБрокером,
		|	РеквизитыПодписанта.Подпись КАК НаименованиеПодписанта,
		|	_ДанныеДокументов.Дата КАК ДатаДокумента,
		|	_ДанныеДокументов.НомерПодтверждения КАК НомерПодтверждения,
		|	_ДанныеДокументов.Сумма КАК СуммаМНО,
		|	_ДанныеДокументов.Валюта.ПараметрыПрописиНаРусском КАК ПараметрыПрописиВалютыНаРусском,
		|	_ДанныеДокументов.Валюта.Наименование КАК ВалютаНаименование,
		|	_ДанныеДокументов.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
		|	_ДанныеДокументов.ДатаВозврата КАК ДатаВозврата,
		|	_ДанныеДокументов.Процент КАК Процент,
		|	_ДанныеДокументов.РасчетныйСчет КАК РасчетныйСчет,
		|	_ДанныеДокументов.РасчетныйСчет.ДоговорМНО.НомерДоговора КАК НомерГенСоглашения,
		|	_ДанныеДокументов.РасчетныйСчет.ДоговорМНО.ДатаЗаключения КАК ДатаГенСоглашения,
		|	_ДанныеДокументов.СчетДоверительногоУправления КАК СчетДУ,
		|	_ДанныеДокументов.РасчетныйСчет.НомерСчета КАК НомерСчета
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрФизЛицАнкетные КАК РеквизитыКлиентаАнкетные
		|		ПО _ДанныеДокументов.СчетДоверительногоУправления = РеквизитыКлиентаАнкетные.Объект
		|			И (НЕ РеквизитыКлиентаАнкетные.ЭтоОрганизация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыЮрЛиц КАК РеквизитыБанка
		|		ПО _ДанныеДокументов.РасчетныйСчет = РеквизитыБанка.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыЮрЛиц КАК РеквизитыБрокера
		|		ПО _ДанныеДокументов.Брокер = РеквизитыБрокера.Объект
		|			И (&ВидПечати = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокера КАК _КодыУБрокера
		|		ПО _ДанныеДокументов.Брокер = _КодыУБрокера.Брокер
		|			И _ДанныеДокументов.СчетДоверительногоУправления = _КодыУБрокера.СчетДоверительногоУправления
		|			И (&ВидПечати = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрФизЛицАнкетные КАК РеквизитыОрганизации
		|		ПО _ДанныеДокументов.Организация = РеквизитыОрганизации.Объект
		|			И (РеквизитыОрганизации.ЭтоОрганизация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыФизЛиц КАК РеквизитыПодписанта
		|		ПО (РеквизитыПодписанта.ФизЛицо = &Подписант)";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Подписант", Подписант);
	Запрос.УстановитьПараметр("НомерВерсииФормы", НомерВерсииФормы);
	Запрос.УстановитьПараметр("ВидПечати", ВидПечати);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбщийМассив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураРеквизитов = Новый Структура;
		
		СтруктураРеквизитов.Вставить("ДатаДокумента", Формат(Выборка.ДатаДокумента, "ДФ='«dd» MMMM yyyy ""г.""'"));
		СтруктураРеквизитов.Вставить("ВремяДокумента", Формат(Выборка.ДатаДокумента, "ДФ='«ЧЧ» ""ч."" «mm» ""мин.""'"));
		СтруктураРеквизитов.Вставить("ДатаДокументаСокр", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
		СтруктураРеквизитов.Вставить("ВремяДокументаСокр", Формат(Выборка.ДатаДокумента, "ДФ=ЧЧ:мм"));
		СтруктураРеквизитов.Вставить("НаименованиеУК", Выборка.НаименованиеУК);
		СтруктураРеквизитов.Вставить("НаименованиеКлиента", Выборка.НаименованиеКлиента);
		СтруктураРеквизитов.Вставить("НомерПравил", Выборка.НомерПравил);
		СтруктураРеквизитов.Вставить("ДатаОперации", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
		СтруктураРеквизитов.Вставить("ВидСделки", "Подписание Подтверждения № " + Выборка.НомерПодтверждения + " от " + Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
		СтруктураРеквизитов.Вставить("ОписаниеИмущества", "Денежные средства");
		СтруктураРеквизитов.Вставить("КоличествоИмущества", " ");
		СтруктураРеквизитов.Вставить("СуммаСделки", Формат(Выборка.СуммаМНО, "ЧДЦ=2") +  ?(НомерВерсииФормы = 1," (" + ЧислоПрописью(Выборка.СуммаМНО,, Выборка.ПараметрыПрописиВалютыНаРусском) + ")", ""));
		СтруктураРеквизитов.Вставить("ДатаПеререгистрации", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
		СтруктураРеквизитов.Вставить("Подписант", Выборка.НаименованиеПодписанта);
		СтруктураРеквизитов.Вставить("НомерПодтверждения", Выборка.НомерПодтверждения);
		
		Если ВидПечати = 1 Тогда
			
			СтруктураРеквизитов.Вставить("ТипУведомления", "Вывод дс с брокерского на р/с");
			СтруктураРеквизитов.Вставить("НомерСчета", Выборка.КодУБрокера); 
			СтруктураРеквизитов.Вставить("ОписаниеСтр", "счет: " + Выборка.РасчетныйСчет + ", № договора с брокером " + Выборка.КраткоеНаименованиеБрокера + ", " + Выборка.ДоговорСБрокером + " от " +  Формат( Выборка.ДатаДоговораСБрокером, "ДФ='dd.MM.yyyy ""г.""'")); 
			СтруктураРеквизитов.Вставить("Контрагент", Выборка.КраткоеНаименованиеБрокера);
            СтруктураРеквизитов.Вставить("ИННКонтрагента", "ИНН: " + Выборка.ИНН_Брокера + "," + Символы.ПС + "ОГРН: " + Выборка.ОГРН_Брокера); 
			СтруктураРеквизитов.Вставить("ДатаРасчетов", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
			СтруктураРеквизитов.Вставить("УсловияСделки", "Вывод на расчетный счет фонда, открытый в " + Выборка.КраткоеНаименованиеБанка);
			
		Иначе
				
			СтруктураРеквизитов.Вставить("ТипУведомления", "МНО");
			СтруктураРеквизитов.Вставить("НомерСчета", Выборка.НомерСчета);
			СтруктураРеквизитов.Вставить("ОписаниеСтр", Выборка.ВалютаНаименование);
			СтруктураРеквизитов.Вставить("Контрагент", Выборка.НаименованиеБанка);
			СтруктураРеквизитов.Вставить("ИННКонтрагента", Выборка.ИННБанка);
			СтруктураРеквизитов.Вставить("ДатаРасчетов", Формат(Выборка.ДатаВозврата, "ДФ=dd.MM.yyyy"));
			СтруктураРеквизитов.Вставить("УсловияСделки", "Банк обязуется оплатить проценты по сделке в размере " + Формат(Выборка.Процент, "ЧДЦ=2") + "% годовых в порядке, предусмотренном Генеральным соглашением о порядке поддержания минимального неснижаемого остатка на счетах клиента № " + Выборка.НомерГенСоглашения + " от " + Формат(Выборка.ДатаГенСоглашения, "ДФ=dd.MM.yyyy") + "г.");
		    СтруктураРеквизитов.Вставить("Приложение", "Проект Подтверждения № " + Выборка.НомерПодтверждения + " от " + Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"));

		КонецЕсли;
		
		Если НомерВерсииФормы = 3 Тогда 
			
			Если Выборка.ЭтоПиф Тогда 
				СтруктураРеквизитов.Вставить("ВремяДокументаСокр", Формат(ТекущаяДатаСеанса(), "ДФ=ЧЧ:мм"));	
			КонецЕсли;
	
			СтруктураРеквизитов.Вставить("ВалютаНаименование", Выборка.ВалютаНаименование);
			СтруктураРеквизитов.Вставить("ВалютаНаименованиеПолное", Выборка.ВалютаНаименованиеПолное);
			
		КонецЕсли;
		
		РеквизитыФайла = Новый Структура;
		РеквизитыФайла.Вставить("ИмяФайла", 
			РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(
			"УоН_" + СтрЗаменить(Выборка.НаименованиеКлиента, " ", "_")
			+ ?(ВидПечати = 1, "_списание_дс_с_брокерского_счета_", "_МНО_") + Формат(Выборка.ДатаДокумента, "ДФ=ddMMyyyy") 
			+ ?(ЗначениеЗаполнено(Выборка.НомерПодтверждения), "_" + Формат(Выборка.НомерПодтверждения, "ЧН=0; ЧГ=0"), "")));
		
		ОбщийМассив.Добавить(Новый Структура("РеквизитыДокумента, РеквизитыФайла", СтруктураРеквизитов, РеквизитыФайла));
		
	КонецЦикла;
		
	Возврат ОбщийМассив;

КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	НомерВерсииФормы = ПолучитьНомерВерсииФормы(ЭтаФорма.ВидПечати);
	
	Если НомерВерсииФормы = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить макет для печати уведомлений.");
		Возврат;
	КонецЕсли;
	
	МассивУведомлений = ПолучитьМассивУведомлений(СписокДокументов.ВыгрузитьЗначения(), Объект.Подписант, НомерВерсииФормы, ЭтаФорма.ВидПечати);
	
	Если НомерВерсииФормы > 1 Тогда
		
		СформироватьПечатныеФормыУОН_2025(МассивУведомлений, ШаблонПодтверждения, СохранитьПечатнуюФорму, НомерВерсииФормы);
		
		Для Каждого СтруктураДанных Из МассивУведомлений Цикл			
							
			Если СохранитьПечатнуюФорму Тогда
				
				Если НомерВерсииФормы = 2 Тогда
					СтруктураДанных.ПечатнаяФорма.Записать(Объект.КаталогСохранения + "/" + СтруктураДанных.РеквизитыФайла.ИмяФайла + ".xlsx", ТипФайлаТабличногоДокумента.XLSX);
				ИначеЕсли НомерВерсииФормы = 3 Тогда
					СтруктураДанных.ПечатнаяФорма.Записать(Объект.КаталогСохранения + "/" + СтруктураДанных.РеквизитыФайла.ИмяФайла + ".xlsx", ТипФайлаПакетаОтображаемыхДокументов.xlsx);	
				КонецЕсли;
				
			Иначе
				СтруктураДанных.ПечатнаяФорма.Показать();
			КонецЕсли;
					
			ОбработкаПрерыванияПользователя();
			
		КонецЦикла;
				
	ИначеЕсли НомерВерсииФормы = 1 Тогда	
		
		ИмяФайлаШаблонаРаспоряжения = ПолучитьИмяВременногоФайла("docx");
		ШаблонПодтверждения.Записать(ИмяФайлаШаблонаРаспоряжения);
		
		Отказ = Ложь;
		Попытка
			
			// создадим документ MS Word на основании сохраненного шаблона
			WordApp = Новый COMОбъект("Word.Application");
			WordApp.Application.Visible = НЕ СохранитьПечатнуюФорму;
			
			Для Каждого СтруктураРеквизитов Из МассивУведомлений Цикл
				
				Подтверждение = СтруктураРеквизитов.РеквизитыДокумента;
				
				NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблонаРаспоряжения, False, , НЕ СохранитьПечатнуюФорму);
				
				WordVars = NewDoc.Variables;
				Для Каждого РеквизитПодтверждения Из Подтверждение Цикл
					WordVars.Item(РеквизитПодтверждения.Ключ).Value = РеквизитПодтверждения.Значение;
				КонецЦикла;
				
				NewDoc.Fields.Update();
				
				Если СохранитьПечатнуюФорму Тогда
					NewDoc.SaveAs(Объект.КаталогСохранения + "/" + СтруктураРеквизитов.РеквизитыФайла.ИмяФайла + ".doc");	
					NewDoc.Close();
				КонецЕсли;
				
				ОбработкаПрерыванияПользователя();
				
			КонецЦикла;
			
			Если СохранитьПечатнуюФорму Тогда
				WordApp.Application.Quit();
			КонецЕсли;
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
		КонецПопытки;
		
		// удалим файл шаблона
		Попытка
			УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаРаспоряжения);
		Исключение
		КонецПопытки; 
		 	
		Если Отказ Тогда
			ПоказатьПредупреждение(,"Печать документа завершилась с ошибкой"); 
			Возврат;
		КонецЕсли;		
		
		Если НЕ Отказ и НЕ СохранитьПечатнуюФорму Тогда
			WordApp.Application.Activate();
		КонецЕсли;
	
	КонецЕсли;		
		      	
	Если СохранитьПечатнуюФорму Тогда
		ПоказатьПредупреждение(,"Печать документа завершена");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьПечатныеФормыУОН_2025(МассивУведомлений, ШаблонПодтверждения, СохранитьПечатнуюФорму, НомерВерсииФормы)
		
	ОбластьУОН = ШаблонПодтверждения.ПолучитьОбласть("УОН");
	
	Для Каждого СтруктураРеквизитов Из МассивУведомлений Цикл
		
		ПечатнаяФорма = Новый ТабличныйДокумент;
		
		ОбластьУОН.Параметры.Заполнить(СтруктураРеквизитов.РеквизитыДокумента);
		
		ПечатнаяФорма.Вывести(ОбластьУОН);
		
		Если НомерВерсииФормы = 2 Тогда	
			СтруктураРеквизитов.Вставить("ПечатнаяФорма", ПечатнаяФорма); 
		ИначеЕсли НомерВерсииФормы = 3 Тогда
				
			ПакетДляПечати = Новый ПакетОтображаемыхДокументов;
			
			Лист_1 = ПакетДляПечати.Состав.Добавить(ПоместитьВоВременноеХранилище(ПечатнаяФорма, Новый УникальныйИдентификатор));		
			Лист_1.Наименование = "УОН";
			
			ОбластьПриложенияАктивы = ШаблонПодтверждения.ПолучитьОбласть("Приложение");
			ОбластьПриложенияАктивы.Параметры.Заполнить(СтруктураРеквизитов.РеквизитыДокумента);
			ОбластьПриложенияАктивы.Параметры.РеестрИмя = "Реестр активов";
			ОбластьПриложенияАктивы.Параметры.ИдентификаторИмя = "Идентификатор актива";
			ОбластьПриложенияАктивы.Параметры.ОписаниеИдентификатора = "(ISIN, Рег.номер, кадастровый номер, …)";
			
			ФормаПриложенияАктивы = Новый ТабличныйДокумент;
			ФормаПриложенияАктивы.Вывести(ОбластьПриложенияАктивы);
			
			Лист_2 = ПакетДляПечати.Состав.Добавить(ПоместитьВоВременноеХранилище(ФормаПриложенияАктивы, Новый УникальныйИдентификатор));		
			Лист_2.Наименование = "приложение Активы";
			
			ОбластьПриложенияКонтрагенты = ШаблонПодтверждения.ПолучитьОбласть("Приложение");
			ОбластьПриложенияКонтрагенты.Параметры.Заполнить(СтруктураРеквизитов.РеквизитыДокумента);
			ОбластьПриложенияКонтрагенты.Параметры.РеестрИмя = "Реестр контрагентов";
			ОбластьПриложенияКонтрагенты.Параметры.ИдентификаторИмя = "Идентификатор контрагента";
			ОбластьПриложенияКонтрагенты.Параметры.ОписаниеИдентификатора = "(ИНН, ОГНР, TIN,  LEI, КИО, серия и номер паспорта)";
			
			ФормаПриложенияКонтрагенты = Новый ТабличныйДокумент;
			ФормаПриложенияКонтрагенты.Вывести(ОбластьПриложенияКонтрагенты);
			
			Лист_3 = ПакетДляПечати.Состав.Добавить(ПоместитьВоВременноеХранилище(ФормаПриложенияКонтрагенты, Новый УникальныйИдентификатор));		
			Лист_3.Наименование = "приложение Контрагенты";
			
			Если СохранитьПечатнуюФорму Тогда
				СтруктураРеквизитов.Вставить("ПечатнаяФорма", ПакетДляПечати);	
			Иначе
				
				СводныйТабличныйДокумент = Новый ТабличныйДокумент;
				СводныйТабличныйДокумент.ОтображатьСетку = Ложь;
				
				Для Каждого ЭлементСостава Из ПакетДляПечати.Состав Цикл
					СводныйТабличныйДокумент.Вывести(ПолучитьИзВременногоХранилища(ЭлементСостава.Данные));		
				КонецЦикла;
				
				СтруктураРеквизитов.Вставить("ПечатнаяФорма", СводныйТабличныйДокумент);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
				
КонецПроцедуры

#Область УправлениеКаталогом

&НаКлиенте
Процедура КаталогСохраненияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогСохранения + "\");
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогСохранения; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогСохранения = Диалог.Каталог;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти
